import {message} from 'antd'

const codeMap = {
  '10000': '未知错误',
  '10001': '密码错误',
  '10002': '用户不存在',
  '10003': '手机号已注册',
  '10004': '手机号不合法',

  '20001': '需要登录',
  '20002': 'token过期',

  '30001': '投票已经存在',
  '30002': '投票不存在',
  '30003': '私有投票密码错误',
  '30004': '超出投票人数限制',
  '30005': '超出投票时间范围内',
  '30006': '非私密投票',
  '30007': '非创建者',
  '30008': '更新失败',

  '40001': '问题不存在',
  '50001': '选项不存在'
}

export default (code) => {
  if (codeMap[code]) {
    message.error(codeMap[code])
  } else {
    message.error('未知错误')
  }
}
