import { message } from 'antd'

const codeMap = {
  '10000': '未知错误',
  '10001': '密码错误',
  '10002': '用户不存在',
  '10003': '手机号已注册',
  '10004': '手机号不合法',
  '10005': '性别不合法',
  '10006': '用户已存在',
  '20001': '需要登录',
  '20002': 'Token过期',
  '20003': '没有权限',
  '30001': '投票已存在',
  '30002': '投票不存在或者权限不够',
  '30004': '超出投票人数限制',
  '30005': '超出投票时间范围',
  '30007': '已经投过票',
  '30009': '表单验证错误',
  '30010': '已经投过票',
  '50001': '选项不存在',
  '50002': '选项不属于该投票',
  '90001': '验证码错误',
  '90002': '验证码超时',
  '90003': '验证码类型错误',
}

export default (code) => {
  if (codeMap[code]) {
    message.error(codeMap[code])
  } else {
    message.error('未知错误')
  }
}
